0-misc/yunhui/ur9.0/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (0 0 0)
    (6.5 0 0)
    (8.5 0 0)
    (18 0 0)
	(0 2.5 0)
    (6.5 2.5 0)
    (8.5 2.5 0)
    (18 2.5 0)
	(0 4.5 0)
    (6.5 4.5 0)
    (8.5 4.5 0)
    (18 4.5 0)
	(0 7 0)
    (6.5 7 0)
    (8.5 7 0)
    (18 7 0)
	
	(0 0 2.5)
    (6.5 0 2.5)
    (8.5 0 2.5)
    (18 0 2.5)
	(0 2.5 2.5)
    (6.5 2.5 2.5)
    (8.5 2.5 2.5)
    (18 2.5 2.5)
	(0 4.5 2.5)
    (6.5 4.5 2.5)
    (8.5 4.5 2.5)
    (18 4.5 2.5)
	(0 7 2.5)
    (6.5 7 2.5)
    (8.5 7 2.5)
    (18 7 2.5)
	
	(0 0 4.5)
    (6.5 0 4.5)
    (8.5 0 4.5)
    (18 0 4.5)
	(0 2.5 4.5)
    (6.5 2.5 4.5)
    (8.5 2.5 4.5)
    (18 2.5 4.5)
	(0 4.5 4.5)
    (6.5 4.5 4.5)
    (8.5 4.5 4.5)
    (18 4.5 4.5)
	(0 7 4.5)
    (6.5 7 4.5)
    (8.5 7 4.5)
    (18 7 4.5)
	
	(0 0 7)
    (6.5 0 7)
    (8.5 0 7)
    (18 0 7)
	(0 2.5 7)
    (6.5 2.5 7)
    (8.5 2.5 7)
    (18 2.5 7)
	(0 4.5 7)
    (6.5 4.5 7)
    (8.5 4.5 7)
    (18 4.5 7)
	(0 7 7)
    (6.5 7 7)
    (8.5 7 7)
    (18 7 7)
    
);

blocks
(
    hex (0 1 5 4 16 17 21 20) (47 18 18) simpleGrading (0.962 0.90154 0.90154)
	hex (1 2 6 5 17 18 22 21) (40 18 18) simpleGrading (1 0.90154 0.90154)
	hex (2 3 7 6 18 19 23 22) (67 18 18) simpleGrading (1.0278 0.90154 0.90154)
	hex (4 5 9 8 20 21 25 24) (47 40 18) simpleGrading (0.962 1 0.90154)
	hex (5 6 10 9 21 22 26 25) (40 40 18) simpleGrading (1 1 0.90154)
	hex (6 7 11 10 22 23 27 26) (67 40 18) simpleGrading (1.0278 1 0.90154)
	hex (8 9 13 12 24 25 29 28) (47 18 18) simpleGrading (0.962 1.10921 0.90154)
	hex (9 10 14 13 25 26 30 29) (40 18 18) simpleGrading (1 1.10921 0.90154)
	hex (10 11 15 14 26 27 31 30) (67 18 18) simpleGrading (1.0278 1.10921 0.90154)
	
	hex (16 17 21 20 32 33 37 36) (47 18 40) simpleGrading (0.962 0.90154 1)
	hex (17 18 22 21 33 34 38 37) (40 18 40) simpleGrading (1 0.90154 1)
	hex (18 19 23 22 34 35 39 38) (67 18 40) simpleGrading (1.0278 0.90154 1)
	hex (20 21 25 24 36 37 41 40) (47 40 40) simpleGrading (0.962 1 1)
	hex (21 22 26 25 37 38 42 41) (40 40 40) simpleGrading (1 1 1)
	hex (22 23 27 26 38 39 43 42) (67 40 40) simpleGrading (1.0278 1 1)
	hex (24 25 29 28 40 41 45 44) (47 18 40) simpleGrading (0.962 1.10921 1)
	hex (25 26 30 29 41 42 46 45) (40 18 40) simpleGrading (1 1.10921 1)
	hex (26 27 31 30 42 43 47 46) (67 18 40) simpleGrading (1.0278 1.10921 1)
	
    hex (32 33 37 36 48 49 53 52) (47 18 18) simpleGrading (0.962 0.90154 1.10921)
	hex (33 34 38 37 49 50 54 53) (40 18 18) simpleGrading (1 0.90154 1.10921)
	hex (34 35 39 38 50 51 55 54) (67 18 18) simpleGrading (1.0278 0.90154 1.10921)
	hex (36 37 41 40 52 53 57 56) (47 40 18) simpleGrading (0.962 1 1.10921)
	hex (37 38 42 41 53 54 58 57) (40 40 18) simpleGrading (1 1 1.10921)
	hex (38 39 43 42 54 55 59 58) (67 40 18) simpleGrading (1.0278 1 1.10921)
	hex (40 41 45 44 56 57 61 60) (47 18 18) simpleGrading (0.962 1.10921 1.10921)
	hex (41 42 46 45 57 58 62 61) (40 18 18) simpleGrading (1 1.10921 1.10921)
	hex (42 43 47 46 58 59 63 62) (67 18 18) simpleGrading (1.0278 1.10921 1.10921)	
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 16 20 4)
			(4 20 24 8)
			(8 24 28 12)
			(16 32 36 20)
			(20 36 40 24)
			(24 40 44 28)
			(32 48 52 36)
			(36 52 56 40)
			(40 56 60 44)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (3 19 23 7)
			(7 23 27 11)
			(11 27 31 15)
			(19 35 39 23)
			(23 39 43 27)
			(27 43 47 31)
			(35 51 55 39)
			(39 55 59 43)
			(43 59 63 47)
        );
    }
    upperWall
    {
        type wall;
        faces
        (
            (12 13 29 28)
			(13 14 30 29)
			(14 15 31 30)
			(28 29 45 44)
			(29 30 46 45)
			(30 31 47 46)
			(44 45 61 60)
			(45 46 62 61)
			(46 47 63 62)
        );
    }
    lowerWall
    {
        type wall;
        faces
        (
            (0 1 17 16)
			(1 2 18 17)
			(2 3 19 18)
			(16 17 33 32)
			(17 18 34 33)
			(18 19 35 34)
			(32 33 49 48)
			(33 34 50 49)
			(34 35 51 50)
        );
    }
    frontAndBack
    {
        type wall;
        faces
        (
            (0 1 5 4)
            (1 2 6 5)
			(2 3 7 6)
			(4 5 9 8)
            (5 6 10 9)
			(6 7 11 10)
			(8 9 13 12)
            (9 10 14 13)
			(10 11 15 14)
			
			(48 49 53 52)
            (49 50 54 53)
			(50 51 55 54)
			(52 53 57 56)
            (53 54 58 57)
			(54 55 59 58)
			(56 57 61 60)
            (57 58 62 61)
			(58 59 63 62)			
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
