0-misc/yunhui/ur9.0/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inlet
    {
        type            patch;
        nFaces          5776;
        startFace       2639328;
    }
    outlet
    {
        type            patch;
        nFaces          5776;
        startFace       2645104;
    }
    upperWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          11704;
        startFace       2650880;
    }
    lowerWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          11704;
        startFace       2662584;
    }
    frontAndBack
    {
        type            wall;
        inGroups        1(wall);
        nFaces          23408;
        startFace       2674288;
    }
)

// ************************************************************************* //
